----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  Layer (type)                                             Input Shape                                                                                    Output Shape                                               Param #    
==================================================================================================================================================================================================================================
    Conv2D-1                                           [[1, 3, 256, 256]]                                                                               [1, 64, 256, 256]                                             1,792     
SyncBatchNorm-1                                        [[1, 64, 256, 256]]                                                                              [1, 64, 256, 256]                                              256      
  ConvBNReLU-1                                         [[1, 3, 256, 256]]                                                                               [1, 64, 256, 256]                                               0       
    Conv2D-2                                           [[1, 64, 256, 256]]                                                                              [1, 64, 256, 256]                                            36,928     
SyncBatchNorm-2                                        [[1, 64, 256, 256]]                                                                              [1, 64, 256, 256]                                              256      
  ConvBNReLU-2                                         [[1, 64, 256, 256]]                                                                              [1, 64, 256, 256]                                               0       
  MaxPool2D-1                                          [[1, 64, 256, 256]]                                                                              [1, 64, 128, 128]                                               0       
    Conv2D-3                                           [[1, 64, 128, 128]]                                                                             [1, 128, 128, 128]                                            73,856     
SyncBatchNorm-3                                       [[1, 128, 128, 128]]                                                                             [1, 128, 128, 128]                                              512      
  ConvBNReLU-3                                         [[1, 64, 128, 128]]                                                                             [1, 128, 128, 128]                                               0       
    Conv2D-4                                          [[1, 128, 128, 128]]                                                                             [1, 128, 128, 128]                                            147,584    
SyncBatchNorm-4                                       [[1, 128, 128, 128]]                                                                             [1, 128, 128, 128]                                              512      
  ConvBNReLU-4                                        [[1, 128, 128, 128]]                                                                             [1, 128, 128, 128]                                               0       
  MaxPool2D-2                                         [[1, 128, 128, 128]]                                                                              [1, 128, 64, 64]                                                0       
    Conv2D-5                                           [[1, 128, 64, 64]]                                                                               [1, 256, 64, 64]                                             295,168    
SyncBatchNorm-5                                        [[1, 256, 64, 64]]                                                                               [1, 256, 64, 64]                                              1,024     
  ConvBNReLU-5                                         [[1, 128, 64, 64]]                                                                               [1, 256, 64, 64]                                                0       
    Conv2D-6                                           [[1, 256, 64, 64]]                                                                               [1, 256, 64, 64]                                             590,080    
SyncBatchNorm-6                                        [[1, 256, 64, 64]]                                                                               [1, 256, 64, 64]                                              1,024     
  ConvBNReLU-6                                         [[1, 256, 64, 64]]                                                                               [1, 256, 64, 64]                                                0       
  MaxPool2D-3                                          [[1, 256, 64, 64]]                                                                               [1, 256, 32, 32]                                                0       
    Conv2D-7                                           [[1, 256, 32, 32]]                                                                               [1, 512, 32, 32]                                            1,180,160   
SyncBatchNorm-7                                        [[1, 512, 32, 32]]                                                                               [1, 512, 32, 32]                                              2,048     
  ConvBNReLU-7                                         [[1, 256, 32, 32]]                                                                               [1, 512, 32, 32]                                                0       
    Conv2D-8                                           [[1, 512, 32, 32]]                                                                               [1, 512, 32, 32]                                            2,359,808   
SyncBatchNorm-8                                        [[1, 512, 32, 32]]                                                                               [1, 512, 32, 32]                                              2,048     
  ConvBNReLU-8                                         [[1, 512, 32, 32]]                                                                               [1, 512, 32, 32]                                                0       
  MaxPool2D-4                                          [[1, 512, 32, 32]]                                                                               [1, 512, 16, 16]                                                0       
    Conv2D-9                                           [[1, 512, 16, 16]]                                                                               [1, 512, 16, 16]                                            2,359,808   
SyncBatchNorm-9                                        [[1, 512, 16, 16]]                                                                               [1, 512, 16, 16]                                              2,048     
  ConvBNReLU-9                                         [[1, 512, 16, 16]]                                                                               [1, 512, 16, 16]                                                0       
   Conv2D-10                                           [[1, 512, 16, 16]]                                                                               [1, 512, 16, 16]                                            2,359,808   
SyncBatchNorm-10                                       [[1, 512, 16, 16]]                                                                               [1, 512, 16, 16]                                              2,048     
 ConvBNReLU-10                                         [[1, 512, 16, 16]]                                                                               [1, 512, 16, 16]                                                0       
   Encoder-1                                           [[1, 3, 256, 256]]                                        [[1, 512, 16, 16], [[1, 64, 256, 256], [1, 128, 128, 128], [1, 256, 64, 64], [1, 512, 32, 32]]]        0       
   Conv2D-11                                           [[1, 1024, 32, 32]]                                                                              [1, 256, 32, 32]                                            2,359,552   
SyncBatchNorm-11                                       [[1, 256, 32, 32]]                                                                               [1, 256, 32, 32]                                              1,024     
 ConvBNReLU-11                                         [[1, 1024, 32, 32]]                                                                              [1, 256, 32, 32]                                                0       
   Conv2D-12                                           [[1, 256, 32, 32]]                                                                               [1, 256, 32, 32]                                             590,080    
SyncBatchNorm-12                                       [[1, 256, 32, 32]]                                                                               [1, 256, 32, 32]                                              1,024     
 ConvBNReLU-12                                         [[1, 256, 32, 32]]                                                                               [1, 256, 32, 32]                                                0       
  UpSampling-1                                [[1, 512, 16, 16], [1, 512, 32, 32]]                                                                      [1, 256, 32, 32]                                                0       
   Conv2D-13                                           [[1, 512, 64, 64]]                                                                               [1, 128, 64, 64]                                             589,952    
SyncBatchNorm-13                                       [[1, 128, 64, 64]]                                                                               [1, 128, 64, 64]                                               512      
 ConvBNReLU-13                                         [[1, 512, 64, 64]]                                                                               [1, 128, 64, 64]                                                0       
   Conv2D-14                                           [[1, 128, 64, 64]]                                                                               [1, 128, 64, 64]                                             147,584    
SyncBatchNorm-14                                       [[1, 128, 64, 64]]                                                                               [1, 128, 64, 64]                                               512      
 ConvBNReLU-14                                         [[1, 128, 64, 64]]                                                                               [1, 128, 64, 64]                                                0       
  UpSampling-2                                [[1, 256, 32, 32], [1, 256, 64, 64]]                                                                      [1, 128, 64, 64]                                                0       
   Conv2D-15                                          [[1, 256, 128, 128]]                                                                              [1, 64, 128, 128]                                            147,520    
SyncBatchNorm-15                                       [[1, 64, 128, 128]]                                                                              [1, 64, 128, 128]                                              256      
 ConvBNReLU-15                                        [[1, 256, 128, 128]]                                                                              [1, 64, 128, 128]                                               0       
   Conv2D-16                                           [[1, 64, 128, 128]]                                                                              [1, 64, 128, 128]                                            36,928     
SyncBatchNorm-16                                       [[1, 64, 128, 128]]                                                                              [1, 64, 128, 128]                                              256      
 ConvBNReLU-16                                         [[1, 64, 128, 128]]                                                                              [1, 64, 128, 128]                                               0       
  UpSampling-3                               [[1, 128, 64, 64], [1, 128, 128, 128]]                                                                     [1, 64, 128, 128]                                               0       
   Conv2D-17                                          [[1, 128, 256, 256]]                                                                              [1, 64, 256, 256]                                            73,792     
SyncBatchNorm-17                                       [[1, 64, 256, 256]]                                                                              [1, 64, 256, 256]                                              256      
 ConvBNReLU-17                                        [[1, 128, 256, 256]]                                                                              [1, 64, 256, 256]                                               0       
   Conv2D-18                                           [[1, 64, 256, 256]]                                                                              [1, 64, 256, 256]                                            36,928     
SyncBatchNorm-18                                       [[1, 64, 256, 256]]                                                                              [1, 64, 256, 256]                                              256      
 ConvBNReLU-18                                         [[1, 64, 256, 256]]                                                                              [1, 64, 256, 256]                                               0       
  UpSampling-4                               [[1, 64, 128, 128], [1, 64, 256, 256]]                                                                     [1, 64, 256, 256]                                               0       
   Decoder-1     [[1, 512, 16, 16], [[1, 64, 256, 256], [1, 128, 128, 128], [1, 256, 64, 64], [1, 512, 32, 32]]]                                        [1, 64, 256, 256]                                               0       
   Conv2D-19                                           [[1, 64, 256, 256]]                                                                              [1, 3, 256, 256]                                              1,731     
==================================================================================================================================================================================================================================
Total params: 13,404,931
Trainable params: 13,389,059
Non-trainable params: 15,872
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 737.50
Params size (MB): 51.14
Estimated Total Size (MB): 789.39
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

{'total_params': 13404931, 'trainable_params': 13389059}
2021-04-09 13:40:52 [INFO]      [EVAL] #Images=21 mIoU=0.8628 Acc=0.9271 Kappa=0.8526
2021-04-09 13:40:52 [INFO]      [EVAL] Class IoU:
[0.8496 0.876 ]
2021-04-09 13:40:52 [INFO]      [EVAL] Class Acc:
[0.9023 0.9479]
2021-04-09 13:40:52 [INFO]      [EVAL] The model with the best validation mIoU (0.8714) was saved at iter 8000.